#!/bin/bash

#002 Shell的简单数学运算

#传递2个参数a,b 计算：a、b和的平方. 测试执行命令：sh sh002.sh 3 4
echo "-----------------eg1---------------------"
#expr：运算符前后要有空格，引用变量要使用$---要空格要$
t=`expr $1 + $2`
t=`expr $t \* $t`
echo $t

echo "-----------------eg2---------------------"
unset t
#$[]：运算符前后不需要空格，引用变量不需要使用$---不要空格不要$
t=$[$1+$2]
t=$[t*t]
echo $t

echo "-----------------eg3---------------------"
unset t
#(())：不要空格要$
((t=$1+$2))
((t=$t*$t))
echo $t


echo "-----------------eg4---------------------"
unset t
#let：不要空格不要$
let "t=($1+$2)**2"
echo $t

